//  Test_03_01_2023
//Время на выполнение: 1 час
//Критерии:
//Вы должны иметь 2 родительских(базовых) классов и по 2 наследующихся класса
//Каждый класс должен иметь не менее 3 переменных(1 из них - массив)
//Все свойства внутри классов должны быть закрытыми(приватными)
//Для массивов создать методы для добавления элемента, переопределения и удаления
//Вы должны иметь хотябы 1 закрытый метод внутри каждого класса
//Для каждого класса делать принт, говорящий о инициализации либо деинициализации элемента
//
//Когда закончите с подготовкой классов - создать по 3 объекта каждого из классов и пользуясь полиморфизмом и оператором is отобразить разные данные в консоль
//Когда перестаете работать с каким-то объектом - деинициализовать его
//Посчитать сколько переменных остались живыми(не были деинициализированы)
//
//
//Максимальное количество баллов за задание - 40
//По истечению 1 часа прием заданий производиться не будет
//  Created by Nurlan Seitov on 3/1/23.
//

import Foundation

var mercedes = Car(model: "W221", age: 2011, )

mercedes.showInfo()

